; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v4 ?v1)
             (pred_12 ?v13 ?v2)
             (pred_7 ?v4 ?v2)
             (pred_6 ?v7 ?v4 )
	     (pred_2 ?v4)
             (pred_5 ?v11)
             (pred_3 ?v13)
             (pred_4 ?v2)
             (pred_1 ?v4)
             (pred_8 ?v13)
             (pred_10 ?v4)
             (pred_11 ))



(:action op_5
:parameters (?v10 ?v8 ?v6 ?v12)
:precondition (and (pred_5 ?v10) (pred_5 ?v8) (pred_3 ?v6) (pred_4 ?v12)
          (pred_9 ?v10 ?v8) (pred_12 ?v6 ?v12)
                   (pred_7 ?v8 ?v12) (pred_2 ?v10) 
                   (pred_1 ?v8) (pred_8 ?v6))
:effect (and  (pred_10 ?v8) (not (pred_1 ?v8))))


(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_5 ?v10) (pred_5 ?v5)
               (pred_2 ?v10) (pred_9 ?v10 ?v5) (pred_10 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v10))))

(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_5 ?v10) (pred_3 ?v6) 
                  (pred_2 ?v10) (pred_6 ?v6 ?v10) (pred_11 ))
:effect (and (pred_8 ?v6)
   (not (pred_6 ?v6 ?v10)) (not (pred_11 ))))


(:action op_2
:parameters (?v10 ?v3 ?v9)
:precondition (and (pred_5 ?v10) (pred_3 ?v3) (pred_3 ?v9)
                  (pred_2 ?v10) (pred_8 ?v9) (pred_6 ?v3 ?v10))
:effect (and (pred_8 ?v3) (pred_6 ?v9 ?v10)
        (not (pred_8 ?v9)) (not (pred_6 ?v3 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_5 ?v10) (pred_3 ?v6) 
                  (pred_2 ?v10) (pred_8 ?v6))
:effect (and (pred_11 ) (pred_6 ?v6 ?v10) (not (pred_8 ?v6)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_08 obj_03 obj_04 obj_06 obj_12 obj_10 obj_07 obj_11
    obj_13 obj_02
    obj_01 obj_05
    )

    (:init
       (pred_11)

       (pred_5 obj_09)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_12)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_05)

       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_03)
       (pred_7  obj_12 obj_13)
       (pred_7  obj_03 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_08)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_11)

       (pred_12  obj_01 obj_13)
       (pred_12  obj_05 obj_02)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_05 obj_10)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_6 obj_01 obj_07)
       (pred_6 obj_05 obj_07)
    ))
(:constraints
  (always (not (pred_2 obj_06)))
)
)

; plan
1. (op_3 obj_10 obj_05)
   deleted: (pred_6 obj_05 obj_10) (pred_11)
   added: (pred_8 obj_05)
   goals met: 0 of 2
2. (op_4 obj_10 obj_07)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_07)
   goals met: 0 of 2
3. (op_1 obj_07 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_11) (pred_6 obj_05 obj_07)
   goals met: 1 of 2
4. (op_4 obj_07 obj_10)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_10)
   goals met: 1 of 2
5. (op_4 obj_10 obj_04)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_04)
   goals met: 1 of 2
6. (op_4 obj_04 obj_09)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_09)
   goals met: 1 of 2
7. (op_3 obj_09 obj_01)
   deleted: (pred_6 obj_01 obj_09) (pred_11)
   added: (pred_8 obj_01)
   goals met: 1 of 2
8. (op_4 obj_09 obj_04)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_04)
   goals met: 1 of 2
9. (op_4 obj_04 obj_10)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_10)
   goals met: 1 of 2
10. (op_4 obj_10 obj_07)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_07)
   goals met: 1 of 2
11. (op_1 obj_07 obj_01)
   deleted: (pred_8 obj_01)
   added: (pred_11) (pred_6 obj_01 obj_07)
   goals met: 2 of 2
